згзбк▌⌠▌Кмфакщ▌ах▌Бащз▌Гююамкюмк╓йкщмэгчзгаю▌⌠▌Гю▌о▌ыаэбй▌ыфкэк▌згцк▌лкюйщ┌▌гююамкюмк▌хойкщ▌бгек▌кмфакщ▌гю▌зфк▌ыгюй─▌Гющчгэкй▌лв▌зфк▌щзвбк▌ах▌Бкьоэ┌▌гз▌мочзшэкщ▌хбккзгюи▌цацкюзщ▌оюй▌цкцаэгкщ─╓чэацчз▌⌠▌Кцазгаюоб▌оюй▌озцащчфкэгм▌зэоме┌▌лбкюйгюи▌зэойгзгаюоб▌цкбайгкщ▌ыгзф▌цайкэю▌кбкмзэаюгм▌кбкцкюзщ┌▌йккч▌лощщ┌▌кзфкэкоб▌чойщ┌▌щаазфгюи▌эфвзфц┌▌фкоэзхкбз▌цобк▌оюй▌хкцобк▌ьамоб▌фоэцаюгкщ┌▌юащзобигм▌оюй▌маюзкцчбозгьк▌цаай╓маькэОэзЧэацчз▌⌠▌Олщзэомз▌гцоикэв▌ах▌згцк▌шюэоькбгюи┌▌ыгзф▌щахз▌чощзкб▌мабаэщ▌лбкюйгюи▌гюза▌йккч▌лбшкщ▌оюй▌чшэчбкщ┌▌мочзшэгюи▌о▌щкющк▌ах▌юащзобиго▌оюй▌бащз▌цкцаэгкщ▌гю▌о▌маюзкцчаэоэв▌щзвбк╓щхж▌⌠▌щахз▌мфгцкщ┌▌йгщзоюз▌кмфакщ┌▌икюзбк▌ыгюй▌эшщзбгюи┌▌щшлзбк▌фкоэзлкозщ╓ьамобщ▌⌠▌цобк▌оюй▌хкцобк▌ьамоб▌фоэцаюгкщ┌▌икюзбк▌оюй▌кцазгаюоб┌▌бовкэкй▌кмфакщ╓ьамобщЩзэшмзшэкй▌⌠▌озцащчфкэгм▌зэоме┌▌ыгзф▌о▌щцаазф▌гюзэа▌оюй▌о▌икюзбк▌ашзэа┌▌гюмбшйгюи▌эгщгюи▌щыкббщ┌▌ыгзф▌фкоэзхкбз▌ьамоб▌фоэцаюгкщ╓еквыаэйщ▌⌠▌оцлгкюз▌кбкмзэаюгм▌ыаэбйцшщгм▌мфгббашз▌щашюйзэоме▌кзфкэкоб▌юащзобигм▌маюзкцчбозгьк▌мгюкцозгм▌Бкьоэ╓майкЮоцк▌⌠▌Щбошифзкэфашщк┐Хгьк╓лчц▌⌠▌≈·╓икюэкГючшз▌⌠▌╓чэацчзГючшз▌⌠▌Зэоме▌гющчгэкй▌лв▌Бкьоэ▌┐▌N
5N
1▌N
9N
)N
▌N
$▌N
9N
▌N
;▌N
N
4N
N
L3
^16:│▌щфаэзщ▌баьк▌зэкюйгюи▌войкю▌N
▌Бкьоэ▌щзшзощ─▌Шщк▌щгцгбоэ▌цшщгмоб▌ьглк┌▌цаай┌▌щзвбк┌▌икюэк┌▌гющзэшцкюзщ─╓бкззкэ▌⌠▌Щ╓гюмбшйкЬамоб▌⌠▌Хобщк╓оччЬкэщгаю▌⌠▌ь°·°⌡÷·÷⌡╓йшэозгаю▌⌠▌°·≈≈⌡⌡╓╓бвэгмщ▌⌠▌Угюзэа▌┐▌Щахз▌ОыоекюгюиС╓╓Уькэщк▌┐▌Ыфгщчкэгюи▌ЩфойаыщС▌▌╓Икюзбк▌ыгюйщ▌ах▌вкщзкэйов▌▌╓Кмфакщ▌гю▌зфк▌хойгюи▌бгифз▌▌╓Цкцаэгкщ▌бгек▌щфойаыщ▌чбов▌▌╓Гю▌зфк▌щгбкюмк▌ах▌зфк▌югифз▌▌╓аааааа╓╓Умфаэшщ▌┐▌Бащз▌ЗгцкС▌▌╓ггггггггг▌▌╓Згцк▌шюэоькбщ┌▌гююамкюмк▌бащз▌▌╓Гю▌йэкоцщ┌▌ык▌хгюй▌ыфоз▌гз▌мащз▌▌╓щфффффф╓╓Улэгйик▌┐▌Юащзобигм▌ЛэккткС▌▌╓Чощзкб▌ыфгщчкэщ┌▌лбшкщ▌оюй▌чшэчбкщ▌▌╓Хойгюи▌щмкюкщ▌ах▌мфгбйфаай▌мгэмбкщ▌▌╓офффффф╓╓Уькэщк▌┐▌Хойгюи▌ЦкцаэгкщС▌▌╓Щахзбв┌▌щахзбв┌▌ьагмкщ▌мобб▌▌╓Гю▌зфк▌кмфакщ┌▌ык▌хгюй▌обб▌▌╓ттттттффффф╓╓Уибгзмф▌хойк▌┐▌Згцк┴щ▌КцлэомкС▌▌╓УАшзэа▌┐▌Икюзбк▌ЙэгхзС╓╓Мэкозкй▌лв▌ОЗ▌Чбовкэ╓фззчщ■││ыыы─озчбовкэ─мац╓╓Мачвэгифз▌l▌°·°⌡▌Оезгщ▌Гюм─